<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.lambdas_app.data.archive_file.daily_coffee: Reading...
module.lambdas_app.data.archive_file.daily_coffee: Read complete after 0s [id=10f3e7bfd18b005e7607502a64ef59a3d3605cd7]
module.lambdas_app.aws_iam_policy.lambda: Refreshing state... [id=arn:aws:iam::057149530255:policy/aws_iam_policy_for_terraform_aws_lambda_role-dev]
module.lambdas_app.aws_iam_role.lambda: Refreshing state... [id=terraform_aws_lambda_role-dev]
module.lambdas_app.aws_iam_role_policy_attachment.attach_iam_policy_to_iam_role: Refreshing state... [id=terraform_aws_lambda_role-dev-20231018224913269300000001]
module.lambdas_app.aws_lambda_function.daily_coffee: Refreshing state... [id=daily_coffee-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api_app.aws_api_gateway_deployment.stage will be created
  + resource "aws_api_gateway_deployment" "stage" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = {
          + "redeployment" = "2be88ca4242c76e8253ac62474851065032d6833"
        }
    }

  # module.api_app.aws_api_gateway_integration.daily_coffee will be created
  + resource "aws_api_gateway_integration" "daily_coffee" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:eu-west-3:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-3:057149530255:function:daily_coffee-dev/invocations"
    }

  # module.api_app.aws_api_gateway_method.daily_coffee will be created
  + resource "aws_api_gateway_method" "daily_coffee" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api_app.aws_api_gateway_resource.daily_coffee will be created
  + resource "aws_api_gateway_resource" "daily_coffee" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "daily-coffee"
      + rest_api_id = (known after apply)
    }

  # module.api_app.aws_api_gateway_resource.root will be created
  + resource "aws_api_gateway_resource" "root" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "api"
      + rest_api_id = (known after apply)
    }

  # module.api_app.aws_api_gateway_rest_api.this will be created
  + resource "aws_api_gateway_rest_api" "this" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Main API for CoffeeMate App"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "coffeemate-dev-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)
    }

  # module.api_app.aws_api_gateway_stage.stage will be created
  + resource "aws_api_gateway_stage" "stage" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "stage"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # module.api_app.aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "daily_coffee-dev"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @erikmichel-dev, Action: `pull_request`